mnishiguchi/AtomVM/src/platforms/ch32v006/ch32v006_peripherals.c
/*
 * This file is part of AtomVM.
 *
 * SPDX-License-Identifier: Apache-2.0 OR LGPL-2.1-or-later
 */

#include "ch32v006_peripherals.h"
#include "ch32v006_pins.h"

#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include <ch32fun.h>

#include <context.h>
#include <defaultatoms.h>
#include <interop.h>
#include <memory.h>
#include <term.h>
#include <utils.h>

#define CH32V006_IO_TIMEOUT_MS 10U
#define CH32V006_IO_TIMEOUT_TICKS (DELAY_MS_TIME * CH32V006_IO_TIMEOUT_MS)
#define CH32V006_MAX_IO_BYTES 64U

#if defined(AVM_CH32V006_UART) || defined(AVM_CH32V006_ADC) \
    || defined(AVM_CH32V006_I2C) || defined(AVM_CH32V006_SPI)
static bool io_timeout_expired(uint32_t start_ticks)
{
    return TimeElapsed32u(funSysTick32(), start_ticks) >= CH32V006_IO_TIMEOUT_TICKS;
}
#endif

#if defined(AVM_CH32V006_UART) || defined(AVM_CH32V006_ADC)
static bool wait_register_set32(volatile uint32_t *reg, uint32_t mask)
{
    uint32_t start_ticks = funSysTick32();
    while ((*reg & mask) == 0U) {
        if (io_timeout_expired(start_ticks)) {
            return false;
        }
    }
    return true;
}

static bool wait_register_clear32(volatile uint32_t *reg, uint32_t mask)
{
    uint32_t start_ticks = funSysTick32();
    while ((*reg & mask) != 0U) {
        if (io_timeout_expired(start_ticks)) {
            return false;
        }
    }
    return true;
}
#endif

#if defined(AVM_CH32V006_I2C) || defined(AVM_CH32V006_SPI)
static bool wait_register_set16(volatile uint16_t *reg, uint16_t mask)
{
    uint32_t start_ticks = funSysTick32();
    while ((*reg & mask) == 0U) {
        if (io_timeout_expired(start_ticks)) {
            return false;
        }
    }
    return true;
}

static bool wait_register_clear16(volatile uint16_t *reg, uint16_t mask)
{
    uint32_t start_ticks = funSysTick32();
    while ((*reg & mask) != 0U) {
        if (io_timeout_expired(start_ticks)) {
            return false;
        }
    }
    return true;
}
#endif

#define DEFINE_NIF(name)                                          \
    static const struct Nif name##_nif                            \
        __attribute__((section(".rodata.ch32v006_nifs")))         \
        = {                                                       \
              .base.type = NIFFunctionType, .nif_ptr = nif_##name \
          }

#if defined(AVM_CH32V006_I2C) || defined(AVM_CH32V006_SPI)
static term make_binary(Context *ctx, size_t size, uint8_t **data)
{
    if (size > CH32V006_MAX_IO_BYTES) {
        return term_invalid_term();
    }

    // The normal 32-bit binary threshold moves buffers of 32 bytes or more to
    // separately allocated refc storage.  These bounded peripheral results are
    // cheaper and simpler as process-heap binaries on this 8 KiB target.
    size_t data_terms = ((size + sizeof(term) - 1U) / sizeof(term)) + 1U;
    size_t heap_terms = data_terms + 1U;
    if (memory_ensure_free_opt(ctx, heap_terms, MEMORY_CAN_SHRINK) != MEMORY_GC_OK) {
        return term_invalid_term();
    }

    term *boxed = memory_heap_alloc(&ctx->heap, heap_terms);
    boxed[0] = (data_terms << 6) | TERM_BOXED_HEAP_BINARY;
    boxed[1] = size;
    *data = (uint8_t *) (boxed + 2);
    return ((term) boxed) | TERM_PRIMARY_BOXED;
}
#endif

#ifdef AVM_CH32V006_IO_BINARY_SELF_TEST
static term nif_io_binary_probe(Context *ctx, int argc, term argv[])
{
    UNUSED(argv);
    if (argc != 0) {
        return term_invalid_term();
    }

    uint8_t *data;
    term binary = make_binary(ctx, CH32V006_MAX_IO_BYTES, &data);
    if (term_is_invalid_term(binary)) {
        return binary;
    }
    for (uint8_t i = 0; i < CH32V006_MAX_IO_BYTES; ++i) {
        data[i] = i;
    }
    return binary;
}

static term nif_io_binary_verify(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_heap_binary(argv[0])
        || term_binary_size(argv[0]) != CH32V006_MAX_IO_BYTES) {
        return FALSE_ATOM;
    }

    const uint8_t *data = (const uint8_t *) (term_to_const_term_ptr(argv[0]) + 2);
    for (uint8_t i = 0; i < CH32V006_MAX_IO_BYTES; ++i) {
        if (data[i] != i) {
            return FALSE_ATOM;
        }
    }
    return TRUE_ATOM;
}

DEFINE_NIF(io_binary_probe);
DEFINE_NIF(io_binary_verify);
#endif

#ifdef AVM_CH32V006_UART
static bool uart_initialized;

static void uart1_init(uint32_t baud)
{
    RCC->APB2PCENR |= RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOD | RCC_APB2Periph_USART1;
    AFIO->PCFR1 &= ~AFIO_PCFR1_USART1_RM;
    funPinMode(PD5, GPIO_CFGLR_OUT_10Mhz_AF_PP);
    funPinMode(PD6, GPIO_CFGLR_IN_FLOAT);

    RCC->PB2PRSTR |= RCC_USART1RST;
    RCC->PB2PRSTR &= ~RCC_USART1RST;

    USART1->CTLR1 = 0;
    USART1->CTLR2 = USART_StopBits_1;
    USART1->CTLR3 = 0;
    USART1->BRR = (FUNCONF_SYSTEM_CORE_CLOCK + (baud / 2U)) / baud;
    USART1->CTLR1 = USART_Mode_Tx | USART_Mode_Rx | USART_CTLR1_UE;
    uart_initialized = true;
}

static term nif_uart_init(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t baud = term_to_int(argv[0]);
    if (baud <= 0 || baud > 2000000) {
        return term_invalid_term();
    }
    uart1_init((uint32_t) baud);
    return OK_ATOM;
}

static term nif_uart_write(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_binary(argv[0])) {
        return term_invalid_term();
    }
    size_t size = term_binary_size(argv[0]);
    if (size > CH32V006_MAX_IO_BYTES) {
        return term_invalid_term();
    }
    if (!uart_initialized) {
        return ERROR_ATOM;
    }
    const uint8_t *data = (const uint8_t *) term_binary_data(argv[0]);
    for (size_t i = 0; i < size; ++i) {
        if (!wait_register_set32(&USART1->STATR, USART_STATR_TXE)) {
            return ERROR_ATOM;
        }
        USART1->DATAR = data[i];
    }

    return wait_register_set32(&USART1->STATR, USART_STATR_TC)
        ? term_from_int((avm_int_t) size)
        : ERROR_ATOM;
}

static term nif_uart_read(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    UNUSED(argv);
    if (argc != 0) {
        return term_invalid_term();
    }
    if (!uart_initialized) {
        return ERROR_ATOM;
    }
    if ((USART1->STATR & USART_STATR_RXNE) == 0U) {
        return UNDEFINED_ATOM;
    }
    return term_from_int((avm_int_t) (USART1->DATAR & 0xFFU));
}

DEFINE_NIF(uart_init);
DEFINE_NIF(uart_write);
DEFINE_NIF(uart_read);
#endif

#ifdef AVM_CH32V006_ADC
static const uint8_t adc_pins[8] = {
    PA2, PA1, PC4, PD2, PD3, PD5, PD6, PD4
};

static bool adc_initialized;

static bool adc_init(void)
{
    RCC->CFGR0 = (RCC->CFGR0 & ~(RCC_ADCPRE | RCC_CFGR0_ADC_CLK_MODE | RCC_CFGR0_ADC_CLK_ADJ))
        | RCC_ADCPRE_DIV2;
    RCC->PB2PCENR |= RCC_ADCEN | RCC_IOPAEN | RCC_IOPCEN | RCC_IOPDEN;
    RCC->PB2PRSTR |= RCC_ADC1RST;
    RCC->PB2PRSTR &= ~RCC_ADC1RST;
    ADC1->CTLR1 = 0;
    ADC1->CTLR2 = 0;
    ADC1->RSQR1 = 0;
    ADC1->RSQR2 = 0;

    // Power up first, then allow the ADC's 1 us stabilization interval.
    ADC1->CTLR2 |= ADC_ADON;
    Delay_Us(1);

    // Select and enable the software trigger for the regular conversion group.
    ADC1->CTLR2 |= ADC_EXTSEL_SWSTART | ADC_EXTTRIG;

    // Follow the CH32V00x startup sequence and calibrate once after power-up.
    ADC1->CTLR2 |= ADC_RSTCAL;
    if (!wait_register_clear32(&ADC1->CTLR2, ADC_RSTCAL)) {
        return false;
    }
    ADC1->CTLR2 |= ADC_CAL;
    if (!wait_register_clear32(&ADC1->CTLR2, ADC_CAL)) {
        return false;
    }

