mnishiguchi/AtomVM/src/platforms/ch32v006/ch32v006_peripherals.c
    return true;
}

static term nif_adc_read(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t channel = term_to_int(argv[0]);
    if (channel < 0 || channel > 7) {
        return term_invalid_term();
    }
    if (!adc_initialized) {
        if (!adc_init()) {
            return ERROR_ATOM;
        }
        adc_initialized = true;
    }

    funPinMode(adc_pins[channel], GPIO_CFGLR_IN_ANALOG);
    ADC1->RSQR3 = (uint32_t) channel;
    ADC1->SAMPTR2 &= ~(ADC_SMP0 << (3U * (uint32_t) channel));
    ADC1->SAMPTR2 |= 7U << (3U * (uint32_t) channel);
    ADC1->CTLR2 |= ADC_SWSTART;

    if (!wait_register_set32(&ADC1->STATR, ADC_EOC)) {
        return ERROR_ATOM;
    }
    return term_from_int((avm_int_t) ADC1->RDATAR);
}

DEFINE_NIF(adc_read);
#endif

#ifdef AVM_CH32V006_I2C
#ifndef I2C_EVENT_MASTER_TRANSMITTER_SELECTED
#define I2C_EVENT_MASTER_TRANSMITTER_SELECTED UINT32_C(0x00070082)
#endif
#ifndef I2C_EVENT_MASTER_RECEIVER_SELECTED
#define I2C_EVENT_MASTER_RECEIVER_SELECTED UINT32_C(0x00030002)
#endif

static uint32_t i2c_clock_hz;

static void i2c_setup(uint32_t clock_hz);

static void i2c_recover(void)
{
    if (i2c_clock_hz != 0U) {
        i2c_setup(i2c_clock_hz);
    }
}

static uint32_t i2c_event(void)
{
    uint32_t status1 = I2C1->STAR1;
    uint32_t status2 = I2C1->STAR2;
    return status1 | (status2 << 16);
}

static bool i2c_wait_event(uint32_t event)
{
    uint32_t start_ticks = funSysTick32();
    while ((i2c_event() & event) != event) {
        if ((I2C1->STAR1 & I2C_STAR1_AF) != 0U) {
            I2C1->STAR1 &= ~I2C_STAR1_AF;
            return false;
        }
        if (io_timeout_expired(start_ticks)) {
            i2c_recover();
            return false;
        }
    }
    return true;
}

static bool i2c_wait_idle(void)
{
    if (!wait_register_clear16(&I2C1->STAR2, I2C_STAR2_BUSY)) {
        i2c_recover();
        return false;
    }
    return true;
}

static void i2c_stop(void)
{
    I2C1->CTLR1 |= I2C_CTLR1_STOP;
    I2C1->STAR1 &= ~I2C_STAR1_AF;
}

static void i2c_setup(uint32_t clock_hz)
{
    i2c_clock_hz = clock_hz;
    RCC->APB1PCENR |= RCC_APB1Periph_I2C1;
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO;
    funPinMode(PC1, GPIO_CFGLR_OUT_10Mhz_AF_OD);
    funPinMode(PC2, GPIO_CFGLR_OUT_10Mhz_AF_OD);
    AFIO->PCFR1 &= ~AFIO_PCFR1_I2C1_RM;

    RCC->PB1PRSTR |= RCC_I2C1RST;
    RCC->PB1PRSTR &= ~RCC_I2C1RST;
    I2C1->CTLR1 |= I2C_CTLR1_SWRST;
    I2C1->CTLR1 &= ~I2C_CTLR1_SWRST;

    uint32_t peripheral_clock_mhz = FUNCONF_SYSTEM_CORE_CLOCK / 1000000U;
    I2C1->CTLR2 = (I2C1->CTLR2 & ~I2C_CTLR2_FREQ) | (peripheral_clock_mhz & I2C_CTLR2_FREQ);

    if (clock_hz <= 100000U) {
        I2C1->CKCFGR = (FUNCONF_SYSTEM_CORE_CLOCK / (2U * clock_hz)) & I2C_CKCFGR_CCR;
    } else {
        uint32_t ccr = FUNCONF_SYSTEM_CORE_CLOCK / (3U * clock_hz);
        I2C1->CKCFGR = (ccr & I2C_CKCFGR_CCR) | I2C_CKCFGR_FS;
    }
    I2C1->CTLR1 = I2C_CTLR1_PE | I2C_CTLR1_ACK;
}

static bool i2c_start_address(uint8_t address, bool read)
{
    if (!i2c_wait_idle()) {
        return false;
    }
    I2C1->CTLR1 |= I2C_CTLR1_START;
    if (!i2c_wait_event(I2C_EVENT_MASTER_MODE_SELECT)) {
        return false;
    }
    I2C1->DATAR = ((uint32_t) address << 1) | (read ? 1U : 0U);
    return i2c_wait_event(read ? I2C_EVENT_MASTER_RECEIVER_SELECTED : I2C_EVENT_MASTER_TRANSMITTER_SELECTED);
}

static bool i2c_write_bytes(uint8_t address, const uint8_t *data, size_t size)
{
    if (!i2c_start_address(address, false)) {
        i2c_stop();
        return false;
    }
    for (size_t i = 0; i < size; ++i) {
        if (!wait_register_set16(&I2C1->STAR1, I2C_STAR1_TXE)) {
            i2c_stop();
            i2c_recover();
            return false;
        }
        I2C1->DATAR = data[i];
    }
    if (!i2c_wait_event(I2C_EVENT_MASTER_BYTE_TRANSMITTED)) {
        i2c_stop();
        return false;
    }
    i2c_stop();
    return true;
}

static bool i2c_start_read_address(uint8_t address)
{
    if (!i2c_wait_idle()) {
        return false;
    }
    I2C1->CTLR1 |= I2C_CTLR1_START;
    if (!i2c_wait_event(I2C_EVENT_MASTER_MODE_SELECT)) {
        return false;
    }
    I2C1->DATAR = ((uint32_t) address << 1) | 1U;

    uint32_t start_ticks = funSysTick32();
    while ((I2C1->STAR1 & I2C_STAR1_ADDR) == 0U) {
        if ((I2C1->STAR1 & I2C_STAR1_AF) != 0U) {
            I2C1->STAR1 &= ~I2C_STAR1_AF;
            return false;
        }
        if (io_timeout_expired(start_ticks)) {
            i2c_recover();
            return false;
        }
    }
    return true;
}

static bool i2c_wait_status1(uint32_t mask)
{
    if (!wait_register_set16(&I2C1->STAR1, (uint16_t) mask)) {
        i2c_recover();
        return false;
    }
    return true;
}

static void i2c_clear_addr(void)
{
    (void) I2C1->STAR1;
    (void) I2C1->STAR2;
}

static bool i2c_read_bytes(uint8_t address, uint8_t *data, size_t size)
{
    if (size == 0U) {
        return true;
    }

    I2C1->CTLR1 &= ~I2C_CTLR1_POS;
    if (size == 1U) {
        I2C1->CTLR1 &= ~I2C_CTLR1_ACK;
    } else {
        I2C1->CTLR1 |= I2C_CTLR1_ACK;
    }
    if (!i2c_start_read_address(address)) {
        i2c_stop();
        I2C1->CTLR1 |= I2C_CTLR1_ACK;
        return false;
    }

    if (size == 1U) {
        i2c_clear_addr();
        i2c_stop();
        if (!i2c_wait_status1(I2C_STAR1_RXNE)) {
            I2C1->CTLR1 |= I2C_CTLR1_ACK;
            return false;
        }
        data[0] = (uint8_t) I2C1->DATAR;
        I2C1->CTLR1 |= I2C_CTLR1_ACK;
        return true;
    }

    if (size == 2U) {
        I2C1->CTLR1 |= I2C_CTLR1_POS;
        I2C1->CTLR1 &= ~I2C_CTLR1_ACK;
        i2c_clear_addr();
        if (!i2c_wait_status1(I2C_STAR1_BTF)) {
            i2c_stop();
            I2C1->CTLR1 &= ~I2C_CTLR1_POS;
            I2C1->CTLR1 |= I2C_CTLR1_ACK;
            return false;
        }
        i2c_stop();
        data[0] = (uint8_t) I2C1->DATAR;
        data[1] = (uint8_t) I2C1->DATAR;
        I2C1->CTLR1 &= ~I2C_CTLR1_POS;
        I2C1->CTLR1 |= I2C_CTLR1_ACK;
        return true;
    }

    i2c_clear_addr();
    size_t index = 0;
    size_t remaining = size;
    while (remaining > 3U) {
        if (!i2c_wait_status1(I2C_STAR1_RXNE)) {
            i2c_stop();
            return false;
        }
        data[index++] = (uint8_t) I2C1->DATAR;
        --remaining;
    }

    if (!i2c_wait_status1(I2C_STAR1_BTF)) {
        i2c_stop();
        return false;
    }
    I2C1->CTLR1 &= ~I2C_CTLR1_ACK;
    data[index++] = (uint8_t) I2C1->DATAR;
    --remaining;

    if (!i2c_wait_status1(I2C_STAR1_BTF)) {
        i2c_stop();
        I2C1->CTLR1 |= I2C_CTLR1_ACK;
        return false;
    }
    i2c_stop();
    data[index++] = (uint8_t) I2C1->DATAR;
    --remaining;
    data[index] = (uint8_t) I2C1->DATAR;
    I2C1->CTLR1 |= I2C_CTLR1_ACK;
    return remaining == 1U;
}

