mnishiguchi/AtomVM/src/platforms/ch32v006/ch32v006_peripherals.c
static term nif_i2c_init(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t clock_hz = term_to_int(argv[0]);
    if (clock_hz < 10000 || clock_hz > 400000) {
        return term_invalid_term();
    }
    i2c_setup((uint32_t) clock_hz);
    return OK_ATOM;
}

static term nif_i2c_probe(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t address = term_to_int(argv[0]);
    if (address < 0x08 || address > 0x77) {
        return term_invalid_term();
    }
    if (i2c_clock_hz == 0U) {
        return ERROR_ATOM;
    }
    bool success = i2c_start_address((uint8_t) address, false);
    i2c_stop();
    return success ? OK_ATOM : ERROR_ATOM;
}

static term nif_i2c_write(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 2 || !term_is_integer(argv[0]) || !term_is_binary(argv[1])) {
        return term_invalid_term();
    }
    avm_int_t address = term_to_int(argv[0]);
    size_t size = term_binary_size(argv[1]);
    if (address < 0x08 || address > 0x77 || size > CH32V006_MAX_IO_BYTES) {
        return term_invalid_term();
    }
    if (i2c_clock_hz == 0U) {
        return ERROR_ATOM;
    }
    return i2c_write_bytes((uint8_t) address, (const uint8_t *) term_binary_data(argv[1]), size)
        ? term_from_int((avm_int_t) size)
        : ERROR_ATOM;
}

static term nif_i2c_read(Context *ctx, int argc, term argv[])
{
    if (argc != 2 || !term_is_integer(argv[0]) || !term_is_integer(argv[1])) {
        return term_invalid_term();
    }
    avm_int_t address = term_to_int(argv[0]);
    avm_int_t count = term_to_int(argv[1]);
    if (address < 0x08 || address > 0x77 || count < 0 || count > (avm_int_t) CH32V006_MAX_IO_BYTES) {
        return term_invalid_term();
    }
    if (i2c_clock_hz == 0U) {
        return ERROR_ATOM;
    }

    uint8_t *data;
    term binary = make_binary(ctx, (size_t) count, &data);
    if (term_is_invalid_term(binary)) {
        return binary;
    }
    return i2c_read_bytes((uint8_t) address, data, (size_t) count) ? binary : ERROR_ATOM;
}

DEFINE_NIF(i2c_init);
DEFINE_NIF(i2c_probe);
DEFINE_NIF(i2c_write);
DEFINE_NIF(i2c_read);
#endif

#ifdef AVM_CH32V006_SPI
static bool spi_initialized;

static void spi_setup(uint32_t clock_hz, uint32_t mode)
{
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO | RCC_APB2Periph_SPI1;
    AFIO->PCFR1 &= ~AFIO_PCFR1_SPI1_RM;
    funPinMode(PC5, GPIO_CFGLR_OUT_50Mhz_AF_PP);
    funPinMode(PC6, GPIO_CFGLR_OUT_50Mhz_AF_PP);
    funPinMode(PC7, GPIO_CFGLR_IN_FLOAT);

    RCC->PB2PRSTR |= RCC_SPI1RST;
    RCC->PB2PRSTR &= ~RCC_SPI1RST;

    uint32_t divider = 2U;
    uint32_t br = 0U;
    while ((FUNCONF_SYSTEM_CORE_CLOCK / divider) > clock_hz && divider < 256U) {
        divider <<= 1;
        ++br;
    }

    SPI1->CTLR1 = SPI_NSS_Soft | SPI_Mode_Master | SPI_Direction_2Lines_FullDuplex
        | SPI_DataSize_8b | ((br << 3) & SPI_CTLR1_BR);
    if (mode & 2U) {
        SPI1->CTLR1 |= SPI_CPOL_High;
    } else {
        SPI1->CTLR1 |= SPI_CPOL_Low;
    }
    if (mode & 1U) {
        SPI1->CTLR1 |= SPI_CPHA_2Edge;
    } else {
        SPI1->CTLR1 |= SPI_CPHA_1Edge;
    }
    SPI1->CTLR1 |= SPI_CTLR1_SPE;
    spi_initialized = true;
}

static term nif_spi_init(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 2 || !term_is_integer(argv[0]) || !term_is_integer(argv[1])) {
        return term_invalid_term();
    }
    avm_int_t clock_hz = term_to_int(argv[0]);
    avm_int_t mode = term_to_int(argv[1]);
    if (clock_hz < (avm_int_t) (FUNCONF_SYSTEM_CORE_CLOCK / 256U)
        || clock_hz > (avm_int_t) (FUNCONF_SYSTEM_CORE_CLOCK / 2U)
        || mode < 0 || mode > 3) {
        return term_invalid_term();
    }
    spi_setup((uint32_t) clock_hz, (uint32_t) mode);
    return OK_ATOM;
}

static term nif_spi_transfer(Context *ctx, int argc, term argv[])
{
    if (argc != 1 || !term_is_binary(argv[0])) {
        return term_invalid_term();
    }
    size_t size = term_binary_size(argv[0]);
    if (size > CH32V006_MAX_IO_BYTES) {
        return term_invalid_term();
    }
    if (!spi_initialized) {
        return ERROR_ATOM;
    }
    const uint8_t *tx = (const uint8_t *) term_binary_data(argv[0]);
    uint8_t *rx;
    term binary = make_binary(ctx, size, &rx);
    if (term_is_invalid_term(binary)) {
        return binary;
    }

    for (size_t i = 0; i < size; ++i) {
        if (!wait_register_set16(&SPI1->STATR, SPI_STATR_TXE)) {
            return ERROR_ATOM;
        }
        SPI1->DATAR = tx[i];
        if (!wait_register_set16(&SPI1->STATR, SPI_STATR_RXNE)) {
            return ERROR_ATOM;
        }
        rx[i] = (uint8_t) SPI1->DATAR;
    }

    return wait_register_clear16(&SPI1->STATR, SPI_STATR_BSY) ? binary : ERROR_ATOM;
}

static term nif_spi_transfer_byte(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t value = term_to_int(argv[0]);
    if (value < 0 || value > UINT8_MAX) {
        return term_invalid_term();
    }
    if (!spi_initialized) {
        return ERROR_ATOM;
    }
    if (!wait_register_set16(&SPI1->STATR, SPI_STATR_TXE)) {
        return ERROR_ATOM;
    }
    SPI1->DATAR = (uint8_t) value;
    if (!wait_register_set16(&SPI1->STATR, SPI_STATR_RXNE)) {
        return ERROR_ATOM;
    }
    uint8_t received = (uint8_t) SPI1->DATAR;
    return wait_register_clear16(&SPI1->STATR, SPI_STATR_BSY)
        ? term_from_int(received)
        : ERROR_ATOM;
}

DEFINE_NIF(spi_init);
DEFINE_NIF(spi_transfer);
DEFINE_NIF(spi_transfer_byte);
#endif

#ifdef AVM_CH32V006_PWM
static uint32_t pwm_period;

static term nif_pwm_init(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 1 || !term_is_integer(argv[0])) {
        return term_invalid_term();
    }
    avm_int_t frequency_hz = term_to_int(argv[0]);
    if (frequency_hz <= 0 || frequency_hz > 50000) {
        return term_invalid_term();
    }

    uint32_t ticks = FUNCONF_SYSTEM_CORE_CLOCK / (uint32_t) frequency_hz;
    uint32_t prescaler = (ticks + 65535U) / 65536U;
    if (prescaler == 0U) {
        prescaler = 1U;
    }
    if (prescaler > 65536U) {
        return term_invalid_term();
    }
    pwm_period = ticks / prescaler;
    if (pwm_period < 2U || pwm_period > 65536U) {
        return term_invalid_term();
    }

