mnishiguchi/AtomVM/src/platforms/ch32v006/ch32v006_peripherals.c
    RCC->APB2PCENR |= RCC_APB2Periph_GPIOC | RCC_APB2Periph_AFIO | RCC_APB2Periph_TIM1;
    AFIO->PCFR1 &= ~AFIO_PCFR1_TIM1_RM;
    funPinMode(PC3, GPIO_CFGLR_OUT_10Mhz_AF_PP);
    funPinMode(PC4, GPIO_CFGLR_OUT_10Mhz_AF_PP);
    RCC->APB2PRSTR |= RCC_APB2Periph_TIM1;
    RCC->APB2PRSTR &= ~RCC_APB2Periph_TIM1;

    TIM1->PSC = prescaler - 1U;
    TIM1->ATRLR = pwm_period - 1U;
    TIM1->CHCTLR2 = TIM1_CHCTLR2_OC3M_2 | TIM1_CHCTLR2_OC3M_1
        | TIM1_CHCTLR2_OC4M_2 | TIM1_CHCTLR2_OC4M_1;
    TIM1->CCER |= TIM1_CCER_CC3E | TIM1_CCER_CC4E;
    TIM1->CH3CVR = 0;
    TIM1->CH4CVR = 0;
    TIM1->BDTR |= TIM1_BDTR_MOE;
    TIM1->SWEVGR |= TIM1_SWEVGR_UG;
    TIM1->CTLR1 |= TIM1_CTLR1_CEN;
    return OK_ATOM;
}

static term nif_pwm_set_duty(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    if (argc != 2 || !term_is_integer(argv[0]) || !term_is_integer(argv[1])) {
        return term_invalid_term();
    }
    avm_int_t channel = term_to_int(argv[0]);
    avm_int_t duty = term_to_int(argv[1]);
    if ((channel != 3 && channel != 4) || duty < 0 || duty > 1000) {
        return term_invalid_term();
    }
    if (pwm_period == 0U) {
        return ERROR_ATOM;
    }
    uint32_t compare = (pwm_period * (uint32_t) duty) / 1000U;
    if (channel == 3) {
        TIM1->CH3CVR = compare;
    } else {
        TIM1->CH4CVR = compare;
    }
    return OK_ATOM;
}

DEFINE_NIF(pwm_init);
DEFINE_NIF(pwm_set_duty);
#endif

#ifdef AVM_CH32V006_GPIO_IRQ
static volatile uint8_t gpio_irq_pending;

enum
{
    GPIOInterruptRising,
    GPIOInterruptFalling,
    GPIOInterruptBoth
};

static const AtomStringIntPair interrupt_edge_table[] = {
    { ATOM_STR("\x6", "rising"), GPIOInterruptRising },
    { ATOM_STR("\x7", "falling"), GPIOInterruptFalling },
    { ATOM_STR("\x4", "both"), GPIOInterruptBoth },
    SELECT_INT_DEFAULT(-1)
};

static void gpio_irq_clear_pending(uint32_t line)
{
    NVIC_DisableIRQ(EXTI7_0_IRQn);
    gpio_irq_pending &= (uint8_t) ~line;
    NVIC_EnableIRQ(EXTI7_0_IRQn);
}

static bool gpio_irq_take_pending(uint32_t line)
{
    NVIC_DisableIRQ(EXTI7_0_IRQn);
    bool pending = (gpio_irq_pending & line) != 0U;
    gpio_irq_pending &= (uint8_t) ~line;
    NVIC_EnableIRQ(EXTI7_0_IRQn);
    return pending;
}

static bool irq_pin(term pin_term, int32_t *pin, uint32_t *line, uint32_t *port)
{
    if (!term_is_integer(pin_term)) {
        return false;
    }
    *pin = term_to_int32(pin_term);
    if (!ch32v006_pin_is_safe(*pin)) {
        return false;
    }
    int32_t index = *pin & 0xF;
    int32_t port_index = *pin >> 4;
    if (index < 0 || index > 7 || port_index < 0 || port_index > 3) {
        return false;
    }
    *line = 1U << (uint32_t) index;
    *port = (uint32_t) port_index;
    return true;
}

void EXTI7_0_IRQHandler(void) INTERRUPT_DECORATOR __attribute__((used));
void EXTI7_0_IRQHandler(void)
{
    uint32_t pending = EXTI->INTFR & UINT32_C(0xFF);
    gpio_irq_pending |= (uint8_t) pending;
    EXTI->INTFR = pending;
}

static term nif_gpio_set_pin_interrupt(Context *ctx, int argc, term argv[])
{
    int32_t pin;
    uint32_t line;
    uint32_t port;
    if (argc != 2 || !irq_pin(argv[0], &pin, &line, &port)) {
        return term_invalid_term();
    }
    int edge = interop_atom_term_select_int(interrupt_edge_table, argv[1], ctx->global);
    if (edge < 0) {
        return term_invalid_term();
    }

    uint32_t index = (uint32_t) pin & 0xFU;
    RCC->APB2PCENR |= RCC_APB2Periph_AFIO;
    uint32_t exticr = AFIO->EXTICR;
    exticr &= ~(UINT32_C(3) << (index * 2U));
    exticr |= port << (index * 2U);
    AFIO->EXTICR = exticr;

    EXTI->INTENR |= line;
    EXTI->RTENR &= ~line;
    EXTI->FTENR &= ~line;
    if (edge == GPIOInterruptRising || edge == GPIOInterruptBoth) {
        EXTI->RTENR |= line;
    }
    if (edge == GPIOInterruptFalling || edge == GPIOInterruptBoth) {
        EXTI->FTENR |= line;
    }
    EXTI->INTFR = line;
    gpio_irq_clear_pending(line);
    NVIC_EnableIRQ(EXTI7_0_IRQn);
    return OK_ATOM;
}

static term nif_gpio_clear_pin_interrupt(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    int32_t pin;
    uint32_t line;
    uint32_t port;
    if (argc != 1 || !irq_pin(argv[0], &pin, &line, &port)) {
        return term_invalid_term();
    }
    UNUSED(pin);
    UNUSED(port);
    EXTI->INTENR &= ~line;
    EXTI->RTENR &= ~line;
    EXTI->FTENR &= ~line;
    EXTI->INTFR = line;
    gpio_irq_clear_pending(line);
    if ((EXTI->INTENR & UINT32_C(0xFF)) == 0U) {
        NVIC_DisableIRQ(EXTI7_0_IRQn);
    }
    return OK_ATOM;
}

static term nif_gpio_interrupt_pending(Context *ctx, int argc, term argv[])
{
    UNUSED(ctx);
    int32_t pin;
    uint32_t line;
    uint32_t port;
    if (argc != 1 || !irq_pin(argv[0], &pin, &line, &port)) {
        return term_invalid_term();
    }
    UNUSED(pin);
    UNUSED(port);
    return gpio_irq_take_pending(line) ? TRUE_ATOM : FALSE_ATOM;
}

DEFINE_NIF(gpio_set_pin_interrupt);
DEFINE_NIF(gpio_clear_pin_interrupt);
DEFINE_NIF(gpio_interrupt_pending);
#endif

const struct Nif *ch32v006_peripherals_get_nif(const char *nifname)
{
#ifdef AVM_CH32V006_IO_BINARY_SELF_TEST
    if (strcmp("ch32v006:io_binary_probe/0", nifname) == 0) {
        return &io_binary_probe_nif;
    }
    if (strcmp("ch32v006:io_binary_verify/1", nifname) == 0) {
        return &io_binary_verify_nif;
    }
#endif
#ifdef AVM_CH32V006_UART
    if (strcmp("uart:init/1", nifname) == 0) {
        return &uart_init_nif;
    }
    if (strcmp("uart:write/1", nifname) == 0) {
        return &uart_write_nif;
    }
    if (strcmp("uart:read/0", nifname) == 0) {
        return &uart_read_nif;
    }
#endif
#ifdef AVM_CH32V006_ADC
    if (strcmp("adc:read/1", nifname) == 0) {
        return &adc_read_nif;
    }
#endif
#ifdef AVM_CH32V006_I2C
    if (strcmp("i2c:init/1", nifname) == 0) {
        return &i2c_init_nif;
    }
    if (strcmp("i2c:probe/1", nifname) == 0) {
        return &i2c_probe_nif;
    }
    if (strcmp("i2c:write/2", nifname) == 0) {
        return &i2c_write_nif;
    }
    if (strcmp("i2c:read/2", nifname) == 0) {
        return &i2c_read_nif;
    }
#endif
#ifdef AVM_CH32V006_SPI
    if (strcmp("spi:init/2", nifname) == 0) {
        return &spi_init_nif;
    }
    if (strcmp("spi:transfer/1", nifname) == 0) {
        return &spi_transfer_nif;
    }
    if (strcmp("spi:transfer_byte/1", nifname) == 0) {
        return &spi_transfer_byte_nif;
    }
#endif
#ifdef AVM_CH32V006_PWM
    if (strcmp("pwm:init/1", nifname) == 0) {
        return &pwm_init_nif;
    }
    if (strcmp("pwm:set_duty/2", nifname) == 0) {
        return &pwm_set_duty_nif;
    }
#endif
#ifdef AVM_CH32V006_GPIO_IRQ
    if (strcmp("gpio:set_pin_interrupt/2", nifname) == 0) {
        return &gpio_set_pin_interrupt_nif;
    }
    if (strcmp("gpio:clear_pin_interrupt/1", nifname) == 0) {
        return &gpio_clear_pin_interrupt_nif;
    }
    if (strcmp("gpio:interrupt_pending/1", nifname) == 0) {
        return &gpio_interrupt_pending_nif;
    }
#endif
    return NULL;
}
